import random

# 词库
words = ['KTV', 'ABC',
         '猪', '刀', '虎', '油', '耳',
         '大象', '敲门', '西瓜', '举重', '手机', '打嗝', '牙疼', '猩猩', '蹲下', '香蕉', '拍球', '求婚', '兔子', '跑步', '篮球', '电话', '老鹰',
         '拳击', '睡觉', '雨伞', '刷牙', '企鹅', '唇膏', '武术', '看书', '洗头', '公鸡', '鸭子', '洗澡', '拔河', '沙僧', '圣经', '升旗', '纸杯',
         '跳舞', '游泳', '榴莲', '遛狗', '害羞', '喝水', '眼镜', '跨栏', '握手', '蝴蝶', '骑马', '跳绳', '钻戒', '土豆', '丸子', '网址', '鲜花',
         '白蚁', '画廊', '樱桃', '胡子', '猪脚', '鞋架', '夜晚', '恶魔', '洋葱', '剑道', '蚊帐', '眼镜', '气球', '海浪', '阳台', '摆饰', '椰汁',
         '宝岛', '卡通', '母亲', '漩涡', '香菇', '长江', '礼帽', '火鸡', '虫子', '水饺', '猛男', '照片', '菊花', '律师', '绵羊', '新浪', '冰鞋',
         '地板', '乌龟', '床罩', '犀牛', '瓶子', '鸵鸟', '痔疮', '拥抱', '相框', '卷纸', '工资', '世界', '生物', '大蒜', '名片', '烟灰', '拖把',
         '江南', '漫画', '眼霜', '水表', '举重', '衙门', '和尚', '椰树', '性感', '伪娘', '泡泡', '宝石', '界面', '春联', '茶树', '唱片', '手铐',
         '宠物', '叮当', '衣领', '猩猩', '广告', '升旗', '毛豆', '白宫', '菜包', '饼干', '芹菜', '国画', '古筝', '长城', '火炉', '木耳', '羊驼',
         '熨斗', '星星', '空调', '熊掌', '婴儿', '键盘', '排骨', '济南', '课桌', '奥运', '披风', '金鱼', '天线', '电车', '围棋', '鸽子', '牙套',
         '白领', '包子', '冬瓜', '坐标', '算盘', '阀门', '鹦鹉', '公安', '电阻', '国王', '邮票', '床单', '纽扣', '食物', '发带', '拐杖', '农村',
         '下载', '海藻', '弹簧', '空气', '跳伞', '米饭', '刀叉', '书生', '铁锹', '名字', '牧场', '泡沫', '会计', '索尼', '观音', '薯片', '李宁',
         '书房', '扇子', '蜡笔', '凤梨', '轮椅', '蜡烛', '面包', '菜刀', '酒店', '宾馆', '山丘', '眼线', '枫树', '烟斗', '轮船', '丸子', '海象',
         '背心', '墨镜', '织女', '奥迪', '干冰', '数学', '宿舍', '叉子', '沙漠', '黑猫', '苦瓜', '音响', '刺猬', '大炮', '龙虾', '跳舞', '树木',
         '罗盘', '七夕', '股票', '皮带', '电影', '公牛', '秃顶', '双杠', '老鼠', '袋鼠', '春天', '关羽', '神话', '毛皮', '滑雪', '栈桥', '礼服',
         '海豚', '面板', '板栗', '茶叶', '杯具', '泰山', '网络', '鱼缸', '信鸽', '主机', '黑板', '桌球', '汤勺', '赤壁', '屏风', '花架', '石头',
         '跳绳', '台球', '扫帚', '盖帽', '杯子', '美术', '色眼', '口红', '漏水', '鞭炮', '榴莲', '上衣', '仓库', '瓷器', '大树', '冬瓜', '母亲',
         '白鸽', '餐巾', '耳机', '飞碟', '工资', '荷花', '蝴蝶', '护膝', '花朵', '环保', '击剑', '监狱', '教师', '刘翔', '棉花', '首饰', '手套',
         '水波', '腰带', '烟斗', '衣橱', '医生', '音响', '鹦鹉', '针筒',
         '嗑瓜子', '灭火器', '孙悟空', '吃面条', '打麻将', '主持人', '刮胡子', '乒乓球', '流口水', '升国旗', '语文书', '小霸王', '鲜橙多', '豆沙包',
         '长颈鹿', '扔铅球', '布娃娃', '遥控器', '高跟鞋', '眼睫毛', '拍马屁', '剪指甲', '除草剂', '大头鱼', '篮球架', '实验室', '狮子座', '守门员',
         '牛奶糖', '牛肉干', '牛肉面', '全家桶', '结婚证', '空格键', '系鞋带', '喷香水', '扭秧歌', '照镜子', '奥特曼', '捡钱包', '放风筝', '烘干机',
         '魂斗罗', '鸭嘴帽', '台湾岛', '洋娃娃', '布娃娃', '显示器', '显示屏', '倚天剑', '屠龙刀', '天花板', '热带鱼', '仙人球', '巡洋舰', '仙女座'
         '水仙花', '彼岸花', '刘德华', '玫瑰花', '棒球帽', '棒球棒', '指南针', '阿童木', '大头鱼', '银河系', '打印纸', '烤鱿鱼', '蓝精灵', '日月潭',
         '呼啦圈', '史莱克', '史瑞克', '绿巨人', '三角架', '猪鼻子', '鹰钩鼻', '美人痣', '黑眼圈', '熊猫眼', '梅花鹿', '落地窗', '豆沙包', '衣帽架',
         '签字笔', '史泰龙', '煤气炉', '元宵节', '电饭锅', '贺年卡', '原子弹', '包青天', '老婆饼', '老夫子', '私家车', '人马座', '进化论', '发动机',
         '铁观音', '明信片', '鸭嘴兽', '四不像', '罗汉果', '贝迷会', '西红柿', '钥匙扣', '鼠标垫', '游泳衣', '大熊座', '圣诞树', '计算机', '乒乓球',
         '登山包', '栀子花', '臭豆腐', '鸡脆骨', '康乃馨', '游泳圈', '毛毛虫', '照妖镜', '史努比', '牛仔裤', '传呼机', '热气球', '红绿灯', '宝莲灯',
         '公文包', '日全食', '上网本', '水蜜桃', '张三丰', '椰子汁', '芭蕉扇', '白头翁', '手提袋', '调色盘', '脚趾甲', '音乐盒', '狙击枪', '穿山甲',
         '纯爷们', '木乃伊', '娃娃鱼', '氧气瓶', '折叠床', '蝙蝠侠', '金饭碗', '贵妃椅', '触摸屏', '单人床', '火腿肠', '五行山', '五指山', '科学馆',
         '摄像头', '曾轶可', '月季花', '百合花', '含羞草', '电影院', '方便面', '量角器', '圆周率', '丘比特', '打印机', '纸巾盒', '金丝猴', '北斗星',
         '香蕉皮', '旅游鞋', '游戏机', '加勒比', '接力棒', '乌纱帽', '三文治', '二人转', '广告牌', '录音机', '招财猫', '红楼梦', '毕业证', '干衣机',
         '嘻哈猴', '青春痘', '空格键', '二郎神', '按摩椅', '沐浴露', '调味品', '纪念品', '纪念帽', '登山杖', '登山鞋', '爆米花',
         '鸡犬不宁', '垂头丧气', '一刀两断', '哑口无言', '左顾右盼', '直升飞机', '东张西望', '金鸡独立', '上蹿下跳', '狗急跳墙', '画饼充饥', '晕头转向',
         '三长两短', '心口如一', '大摇大摆', '龟兔赛跑', '目瞪口呆', '破涕为笑', '眉飞色舞', '广播体操', '七上八下', '目瞪口呆', '胸无点墨', '扬州炒饭',
         '满地找牙', '五体投地', '一无所有', '睡眼朦胧', '比翼双飞', '一瘸一拐', '长江三峡', '长颈漏斗', '画龙点睛', '抱头鼠窜', '狗急跳墙', '虎背熊腰',
         '闻鸡起舞', '一手遮天', '捧腹大笑', '心急如焚', '狼吞虎咽', '花枝招展', '七零八落', '如鱼得水', '打草惊蛇', '打草惊蛇', '走马观花', '三头六臂',
         '鸡飞狗跳', '张牙舞爪', '抓耳挠腮', '嬉皮笑脸', '连滚带爬', '掩耳盗铃', '手忙脚乱', '抱头鼠窜', '鸡鸣狗盗', '头破血流', '坐井观天', '眼高手低',
         '手舞足蹈', '张牙舞爪', '婀娜多姿', '挥汗如雨', '纸上谈兵', '含情脉脉', '望梅止渴', '鸡飞狗跳', '鼠目寸光', '盲人摸象', '画蛇添足', '对牛弹琴',
         '一针见血', '大手大脚', '左右为难', '虎头蛇尾', '一分为二', '回眸一笑', '恍然大悟', '守株待兔', '亡羊补牢',
         '大眼瞪小眼',
         ]


class Title():
    def __init__(self):
        pass
    def getIdx(self):
        return random.randint(0, len(words) - 1)

    def getTitle(self, idx):
        return words[idx]

    def getTip(self, idx):
        return "总共 " + str(len(words[idx])) + " 个字"
